title: Python Openurl

description: Netsh helper dll
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.007/T1546.007.md
date: 2021/03/30
tags:
  
status: experimental
author: Adam
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine:
            - '*python*'
    selection2:
        CommandLine:
            - 'openurl'
    condition: selection1 and selection2
falsepositives:
    - Legitimate administration
level: medium